{
  "extensions":
  [
    { "name": "bradlc.vscode-tailwindcss", "description": "Provides Tailwind CSS class name completion, linting, and hover previews in HTML, JavaScript, and other files, enhancing productivity with Tailwind CSS in VS Code." },
    { "name": "christian-kohler.npm-intellisense", "description": "Autocompletes npm modules in import statements, making it easier to reference dependencies without leaving the editor." },
    { "name": "csstools.postcss", "description": "Adds syntax highlighting and IntelliSense for PostCSS, including variables, mixins, and functions, improving the development experience with modern CSS." },
    { "name": "dbaeumer.vscode-eslint", "description": "Integrates ESLint JavaScript linting into VS Code, helping to find and fix problems in JavaScript, TypeScript, and other languages." },
    { "name": "eamodio.gitlens", "description": "Supercharges the built-in VS Code Git capabilities, including advanced blame, branch history, commit searching, and more, enhancing the Git experience." },
    { "name": "eg2.vscode-npm-script", "description": "Provides convenient features for npm scripts, such as validation, running scripts from the editor, and displaying script errors and warnings." },
    { "name": "esbenp.prettier-vscode", "description": "Integrates Prettier, an opinionated code formatter, into VS Code to automatically format JavaScript, TypeScript, CSS, HTML, and more on save or command." },
    { "name": "ms-playwright.playwright", "description": "Supports end-to-end testing with Playwright in VS Code, providing test authoring, execution, and debugging capabilities for web applications." },
    { "name": "wix.vscode-import-cost", "description": "Displays the size of the imported package inline in the editor, helping to understand the impact of adding a new npm package or import to your project." },
    { "name": "yoavbls.pretty-ts-errors", "description": "Enhances TypeScript error messages to make them more readable and easier to understand, improving the TypeScript development experience." },
    { "name": "ZixuanChen.vitest-explorer", "description": "Integrates Vitest into VS Code, providing a test explorer UI that allows you to run and debug Vitest tests directly from the editor." }
  ]
}